bierner.markdown-mermaid
charliermarsh.ruff
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
matangover.mypy
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
njpwerner.autodocstring
nwgh.bandit
pamaron.pytest-runner
pkief.material-icon-theme
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode